namespace MiniUnity
{
    /// <summary>
    /// Компонент поведения.
    /// Для каждой "стороны" поведения объекта можно задавать свой компонент.
    /// Шаблон проектирования «Компонент» (Component) был формализован в 1994 году, 
    /// в книге «Design Patterns: Elements of Reusable Object-Oriented Software», 
    /// написанной «бандой четырех». 
    /// Основная идея шаблона «Компонент» заключается в объединении связанных функций и данных в общий класс 
    /// и в то же время в сохранении каждого класса как можно более маленьким и узкоспе­циализированным.
    /// Кстати, активно применялся в Delphi и VisualBasic, вышедшими ок.1995
    /// </summary>
    public class BehaviorComponent : GameObject{}
}